---
kind: type
id: T:Autodesk.Revit.DB.SolidUtils
source: html/4c285bc6-c14e-9d55-5295-138764c01d12.htm
---
# Autodesk.Revit.DB.SolidUtils

Contains utility functions for solid operations.

## Syntax (C#)
```csharp
public static class SolidUtils
```